// --------------------------------------------------------------------------
// ✅ 실습
// --------------------------------------------------------------------------
// - [ ] 콘솔 패널에서 숫자, 문자열, 불리언 값을 만들어 다음을 연습합니다.
// --------------------------------------------------------------------------

// 1. 문자열(String) 만들고 출력하기
console.log('statement')

// 2. 문자열 두 개 합치기
console.log('x' + ' + y')

// 3. 숫자(Number) 만들고 출력하기
console.log(9200)

// 4. `31`과 `81` 더하기
console.log(31 + 81)

// 5. `502`에서 `271` 빼기
console.log(502 - 271)

// 6. `5`와 `117` 곱하기
console.log(5 * 117)

// 7. `100`을 `8`로 나누기
console.log(100 / 8)

// 8. `502`를 `3`으로 나눈 나머지 구하기
console.log(502 % 3)

// 9. 불리언(Boolean) 만들고 출력하기
console.log(true)
console.log(false)